IDENTIFICATION DIVISION.
PROGRAM-ID. VARIABLES-EXAMPLES.
AUTHOR. ME.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 HUMAN-CONTAINER.
        05 HUMAN-NAME 	PIC A(30).
        05 HUMAN-ADDRESS PIC X(160).
77 SQUARE-METERS   		PIC 9(18).
77 SQUARE-PRICE        	PIC 9(15)V99.
77 FLAT-PRICE			PIC 9(15)V99.
77 TAX-PERCENT          	PIC 9(2).
77 TAX-SUMM              PIC 9(15)V99.
77 NEGATIVE-VALUE		PIC S9(10)V9(6).

77 SQUARE-METERS-OUT    	PIC Z(17)9.
77 SQUARE-PRICE-OUT		PIC Z(14)9V99.
77 FLAT-PRICE-OUT-1		PIC Z(3),Z(3),Z(3),Z(3).99.
77 FLAT-PRICE-OUT-2		PIC Z(3)BZ(3)BZ(3)BZ(3).99.
77 TAX-PERCENT-OUT		PIC Z(2).
77 TAX-SUMM-OUT			PIC Z(14)9V99.
77 NEGATIVE-VALUE-OUT-1	PIC +Z(10).9(6).
77 NEGATIVE-VALUE-OUT-2  PIC -Z(10).9(6).

PROCEDURE DIVISION.
BEGIN.
	DISPLAY "Please enter Name: ".
	ACCEPT HUMAN-NAME.
	DISPLAY "Please enter Address: ".
	ACCEPT HUMAN-ADDRESS.
	DISPLAY "Please enter square meters of flat: ".
	ACCEPT SQUARE-METERS.
	DISPLAY "Please enter square meter's price: ".
	ACCEPT SQUARE-PRICE.
	DISPLAY "Please enter percent of tax: ".
	ACCEPT TAX-PERCENT.
	DISPLAY "Enter any really big NEGATIVE value: ".
	ACCEPT NEGATIVE-VALUE.
	DISPLAY "---------------------------------------".
	DISPLAY " ".
	DISPLAY HUMAN-NAME.
	DISPLAY HUMAN-ADDRESS.
	DISPLAY "SQUARE-METERS: ", SQUARE-METERS.
	MOVE SQUARE-METERS TO SQUARE-METERS-OUT.
	DISPLAY "SQUARE-METERS-OUT: ", SQUARE-METERS-OUT.
	DISPLAY "SQUARE-PRICE: ", SQUARE-PRICE.
	MOVE SQUARE-PRICE TO SQUARE-PRICE-OUT.
	DISPLAY "SQUARE-PRICE-OUT: ", SQUARE-PRICE-OUT.
	MULTIPLY SQUARE-METERS BY SQUARE-PRICE GIVING FLAT-PRICE.
	DISPLAY "FLAT-PRICE: ", FLAT-PRICE.
	MOVE FLAT-PRICE TO FLAT-PRICE-OUT-1 FLAT-PRICE-OUT-2.
	DISPLAY "FLAT-PRICE-OUT-1: ", FLAT-PRICE-OUT-1.
	DISPLAY "FLAT-PRICE-OUT-2: ", FLAT-PRICE-OUT-2.
	DISPLAY "TAX-PERCENT: ", TAX-PERCENT.
	MOVE TAX-PERCENT TO TAX-PERCENT-OUT.
	DISPLAY "TAX-PERCENT-OUT: ", TAX-PERCENT-OUT.



000000* Quelle: https://github.com/romankh3/cobol-code-example/blob/master/src/VariableExamples.cob -> angepasst