IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
PROCEDURE DIVISION.
DISPLAY 'Hello, world'.
STOP RUN.

000000* Quelle: https://www.tutorialspoint.com/compile_cobol_online.php