IDENTIFICATION DIVISION.
PROGRAM-ID. NOTEN.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
77  NAME    PIC A(20)   VALUE SPACES.

77  NOTE1   PIC 99      VALUE 21.
77  NOTE2   PIC 99      VALUE 21.
77  NOTE3   PIC 99      VALUE 21.
77  NOTE4   PIC 99      VALUE 21.

77  FEHLSTUNDEN PIC S99     VALUE -1.
77  FEHLSTUNDEN-M PIC Z9.
77  PRUEFUNG   PIC 99      VALUE 21.
77  EINGABE-NOTE PIC Z9.

77  DURCHSCHNITT   PIC 99V99   VALUE ZERO.
77  ENDE-NOTE  PIC 99V99   VALUE ZERO.

77  NOTE-M  PIC -Z9.9    VALUE ZERO.

77  M-FEHLSTUNDEN PIC S99V99   VALUE ZERO.

01  HEUTE.
    02  JAHR PIC 99      VALUE ZERO.
    02  MONAT PIC 99      VALUE ZERO.
    02  TAG PIC 99      VALUE ZERO.

77  SP    PIC A(1)      VALUE SPACE.

PROCEDURE DIVISION.
HAUPT-VERFAHREN.
    PERFORM EINGABE-VERFAHREN.
    PERFORM BERECHNE-DURCHSCHNITT-VERFAHREN.
    PERFORM FRÜHER-BERICHT-VERFAHREN.
    
    IF DURCHSCHNITT < 10
        DISPLAY "Durchschnitt unter 10 (NICHT BESTANDEN)." AT 0901
    END-IF.

    IF FEHLSTUNDEN > 25  OR  FEHLSTUNDEN/2 > DURCHSCHNITT
        PERFORM SCHLECHTER-STUDENT-BERICHT
    ELSE
        IF DURCHSCHNITT < 10
            PERFORM PRUEFUNG-EINGABE-VERFAHREN
            PERFORM PRUEFUNG-BERICHT-VERFAHREN
        ELSE
            DISPLAY "BESTANDEN." AT 0901
        END-IF
    END-IF.

    ACCEPT SP AT 2001
    STOP RUN.


EINGABE-VERFAHREN.
    DISPLAY SPACE ERASE EOS.
    PERFORM UNTIL (NAME ALPHABETIC) AND (NAME NOT = SPACES)
        DISPLAY "Bitte geben Sie den Namen ein:" AT 1101
        ACCEPT NAME AT 1130
    END-PERFORM.

    PERFORM UNTIL (NOTE1 >= 0) AND (NOTE1 <= 20)
        DISPLAY "Bitte geben Sie die Note 1 ein:" AT 1301
        ACCEPT EINGABE-NOTE AT 1332
        MOVE EINGABE-NOTE TO NOTE1
    END-PERFORM.

    PERFORM UNTIL (NOTE2 >= 0) AND (NOTE2 <= 20)
        DISPLAY "Bitte geben Sie die Note 2 ein:" AT 1401
        ACCEPT EINGABE-NOTE AT 1432
        MOVE EINGABE-NOTE TO NOTE2
    END-PERFORM.

    PERFORM UNTIL (NOTE3 >= 0) AND (NOTE3 <= 20)
        DISPLAY "Bitte geben Sie die Note 3 ein:" AT 1501
        ACCEPT EINGABE-NOTE AT 1532
        MOVE EINGABE-NOTE TO NOTE3
    END-PERFORM.

    PERFORM UNTIL (NOTE4 >= 0) AND (NOTE4 <= 20)
        DISPLAY "Bitte geben Sie die Note 4 ein:" AT 1601
        ACCEPT EINGABE-NOTE AT 1632
        MOVE EINGABE-NOTE TO NOTE4
    END-PERFORM.

    PERFORM UNTIL (FEHLSTUNDEN >= 0)
        DISPLAY "Wie viele Fehlstunden gibt es?" AT 1701
        ACCEPT EINGABE-NOTE AT 1725
        MOVE EINGABE-NOTE TO FEHLSTUNDEN
    END-PERFORM.


BERECHNE-DURCHSCHNITT-VERFAHREN.
    COMPUTE DURCHSCHNITT = (NOTE1+NOTE2+NOTE3+NOTE4)/4
    COMPUTE M-FEHLSTUNDEN = DURCHSCHNITT-(FEHLSTUNDEN/2).


FRÜHER-BERICHT-VERFAHREN.
    DISPLAY SPACE ERASE EOS.
    ACCEPT HEUTE FROM DATE.
    DISPLAY TAG AT 0101
    DISPLAY "/" AT 0103
    DISPLAY MONAT AT 0104
    DISPLAY "/" AT 0106
    DISPLAY JAHR AT 0107

    DISPLAY NAME AT 0110

    MOVE NOTE1 TO NOTE-M
    DISPLAY "N1:" AT 0303
    DISPLAY NOTE-M AT 0307

    MOVE NOTE2 TO NOTE-M
    DISPLAY "N2:" AT 0403
    DISPLAY NOTE-M AT 0407

    MOVE NOTE3 TO NOTE-M
    DISPLAY "N3:" AT 0503
    DISPLAY NOTE-M AT 0507

    MOVE NOTE4 TO NOTE-M
    DISPLAY "N4:" AT 0603
    DISPLAY NOTE-M AT 0607

    MOVE DURCHSCHNITT TO NOTE-M.
    DISPLAY "Durchschnitt:" AT 0801
    DISPLAY NOTE-M AT 0808.


SCHLECHTER-STUDENT-BERICHT.
    DISPLAY "NICHT BESTANDEN DURCH FEHLSTUNDEN, MIT NOTE VON" AT 1001
    MOVE M-FEHLSTUNDEN TO NOTE-M
    DISPLAY NOTE-M AT 1036
    DISPLAY "Anzahl der Fehlstunden:" AT 1101
    MOVE FEHLSTUNDEN TO FEHLSTUNDEN-M
    DISPLAY FEHLSTUNDEN-M AT 1119
    DISPLAY "KEINE OPTION FÜR PRÜFUNG." AT 1201.


PRUEFUNG-EINGABE-VERFAHREN.
    PERFORM UNTIL (PRUEFUNG >= 0) AND (PRUEFUNG <= 20)
        DISPLAY "Bitte geben Sie die Prüfungsnote ein:" AT 1001
        ACCEPT EINGABE-NOTE AT 1039
        MOVE EINGABE-NOTE TO PRUEFUNG
    END-PERFORM.


PRUEFUNG-BERICHT-VERFAHREN.
    COMPUTE ENDE-NOTE = (DURCHSCHNITT + PRUEFUNG)/2
    MOVE ENDE-NOTE TO NOTE-M
    DISPLAY "Endnote: " AT 1201
    DISPLAY NOTE-M AT 1213

    IF ENDE-NOTE < 10
        DISPLAY "== NICHT BESTANDEN ==" AT 1301
    ELSE
        DISPLAY "== BESTANDEN ==" AT 1301
    END-IF.


END PROGRAM NOTEN.


000000* Quelle: https://github.com/victordomingos/Learning_COBOL/blob/master/13_notas.cob -> angepasst